README.org
#+TITLE: The Ultimate Doom Emacs Cheatsheet
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* A few tips for Emacs newbies
- Learn to use [[https://www.emacswiki.org/emacs/EmacsClient][emacsclient]] and set up a daemon, your Emacs experience will improve *a lot* and you'll save a lot of time.
- Learn to use Emacs's inner file manager.
- Try to avoid terminal version of emacs when possible.
- =SPC h w= helps you find keyboard shortcuts for different commands, and =SPC h k= tells you how key combinations translate to emacs commands. 
- Github doesn't render org files very well. It's best that you [[https://raw.githubusercontent.com/niyumard/Doom-Emacs-Cheat-Sheet/main/README.org][download this file]] and open it in Emacs. If not possible, use the [[https://naghdbishi.ir/Doom-Emacs-Cheat-Sheet/README.html][html version]] made with [[https://github.com/fniessen/org-html-themes][org-html-themes]]
* Command Abbreviations
- =C= - "Control" key
- =M= - "Alt" or "Option" key
- =S= - "Super" or "Command" key
- =SPC= - "Space" key
* General
- =SPC f s= for saving the current file
- =SPC := for entering a command
- =SPC q q= to close Emacs
- =SPC f D= to delete this file
* Projects with Projectile
- =SPC p p= to open a project
- =SPC SPC= to open a file in a project
- =SPC o p= to open the file explorer
- =SPC o E= to open the shell (eshell) in fullscreen
- =SPC o e= to open the shell (eshell) in a popup window
- =SPC f r= recently visited files
- =SPC f R= recently visited files in a project
- =M-x projectile-discover-projects-in-directory= to find projects
  within given folder using Projectile
- =M-x projectile-discover-projects-in-search-path= to find projects in
  the folder defined by the =projectile-project-search-path= variable
  using Projectile
* Dired
- Dired (Directory Editor) is how you interfaces with a directory
- Press =C-x d= to open dired.
- Use =RET= to go to a folder or open a file.
- Use =-= for going one folder back
- Use =+= for creating a new directory
- Use =d= to mark the files for deletion, press =x= to delete.
- Use =M= to change permissions
- Use =o= to sort by modes.
- Use =O= to change the owner.
- Use =m= to mark and =u= to unmark files or directories.
- =U= to unselect all
- Use =t= to invert the selection.
- =t= to switch between files and directories
- Use =C= to copy.
- Use =R= to move.
- Move with =h=, =j=, =k=, =l=
- Toggle =(= for simple view
- =SPC .= to create or find a file
- =*= to select all directories.
- =C= copy to another window
- =R= move to another window
- =dired-do-what-i-mean-target= set to true
- =i= to edit file/dir name
* Buffers, Windows and Basic Navigation
** Buffers
- Buffers are a special concept in emacs they can be terminals, files,
  directories, etc
- =SPC b b= to open another buffer
  - workspace buffer
- =SPC b B= you can see all the buffer
- =SPC ,= to switch buffers (its an alias)
- =SPC SHIFT ,= to switch to all buffers
- =SPC b X= You can create a scratch buffer
- =SPC b s= to save and name it
** Windows
- =SPC w v= window split vertically
- =SPC w s= window split horizonal
- =SPC w w= to switch windows
- =SPC w q= to close window, frame, quit EMACS if last frame
- =SPC w += and =SPC w -= to increase and decrease window height
- =SPC w >= and =SPC w <= to increase and decrease window width
- You can use vim motion keys to navigate between open windows for example =SPC w H= moves the window to the left.
- Windows are panes in your screen
** Workspaces
- =SPC TAB n= New workspace
- =SPC TAB N= Newly named workspace
- =SPC TAB [= Previous workspace
- =SPC TAB ]= Next workspace
- =SPC TAB d= Remove workspace
- =SPC TAB R= Restore last session
- =M-1= Switch to workspace 1
- =M-2= Switch to workspace 2 and so forth.
* Installing Packages using org-super-agenda as an example
- =SPC f p= to open the config.
- To add a package, add the package to =.doom.d/package.el=
- Then close and =doom refresh=
- Then go to =.doom.d/config.el= to configure the package
- =def-package!= is a macro you can use to configure packages
  - =space h help= you can look up method man pages
  - =:init= is used for setting the package up
  - =:config= to set configuration after the package has been
    initialized
  - =:after= lets you set which package it should load after
- You can use =:after!= to configure packages that are already there
* Quick, horizontal movements with evil-snipe
