README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-17 Wed 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Ultimate Doom Emacs Cheatsheet</title>
<meta name="author" content="Hossein Naghdbishi" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Ultimate Doom Emacs Cheatsheet</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7590b20">1. A few tips for Emacs newbies</a></li>
<li><a href="#orgc66952c">2. Command Abbreviations</a></li>
<li><a href="#orgbd3b08d">3. General</a></li>
<li><a href="#orga06ffba">4. Projects with Projectile</a></li>
<li><a href="#org7ea6b6f">5. Dired</a></li>
<li><a href="#org5424a93">6. Buffers, Windows and Basic Navigation</a>
<ul>
<li><a href="#org7465159">6.1. Buffers</a></li>
<li><a href="#org40aac09">6.2. Windows</a></li>
<li><a href="#orge5e8a5c">6.3. Workspaces</a></li>
</ul>
</li>
<li><a href="#orgdd329c8">7. Installing Packages using org-super-agenda as an example</a></li>
<li><a href="#orga100aff">8. Quick, horizontal movements with evil-snipe</a>
<ul>
<li><a href="#orgf374984">8.1. Inine navigation</a></li>
<li><a href="#org2847e74">8.2. Long distance navigation inside the file</a></li>
</ul>
</li>
<li><a href="#org4700314">9. Multiple cursor in Emacs with Evil-multiedit</a></li>
<li><a href="#org3742fdd">10. Org Mode</a>
<ul>
<li><a href="#org93e23e9">10.1. Basics</a></li>
<li><a href="#orgd86db83">10.2. Links, Hyperlinks and more</a></li>
<li><a href="#orgf2eac2b">10.3. Defining custoom Link Types</a></li>
<li><a href="#org994f865">10.4. Linking to words &amp; Bookmarks</a></li>
<li><a href="#org5149c05">10.5. Code Snippets &amp; Babel</a></li>
<li><a href="#org0527eeb">10.6. Task Management</a>
<ul>
<li><a href="#orgd401f1b">10.6.1. Priorities for Tasks</a></li>
<li><a href="#orgc9e3975">10.6.2. Marking Tasks with Tags</a></li>
<li><a href="#org8616956">10.6.3. Setting a poperty for a task/headline</a></li>
</ul>
</li>
<li><a href="#org4422b97">10.7. Lists</a></li>
<li><a href="#org07f3b12">10.8. Checkboxes</a>
<ul>
<li><a href="#org65378d5">10.8.1. You can see how many are done with a &ldquo;cookie&rdquo; <code>[1/2]</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4062cb">11. Magit</a>
<ul>
<li><a href="#org6233002">11.1. Git Commit Flow in More Detail</a></li>
<li><a href="#org7f8a9d2">11.2. Magit with Forge for Issuing Pull Requests - Emacs</a></li>
</ul>
</li>
<li><a href="#org8760360">12. Terminal</a></li>
<li><a href="#org1e70de6">13. File Tree</a></li>
<li><a href="#org3fae2c4">14. Others</a></li>
<li><a href="#orgf7f34e7">15. Capturing</a></li>
<li><a href="#org6b8c4b9">16. Org Roam</a></li>
<li><a href="#org1e52724">17. Sources</a></li>
<li><a href="#orga354843">18. What to learn <code>[0/4]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-org7590b20" class="outline-2">
<h2 id="org7590b20"><span class="section-number-2">1.</span> A few tips for Emacs newbies</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>If you learn to use <a href="https://www.emacswiki.org/emacs/EmacsClient">emacsclient</a> and set up a daemon your Emacs experience will improve <b>a lot</b> and you&rsquo;ll live a longer life.</li>
<li>Learn to use Emacs&rsquo;s inner file manager.</li>
<li>Try to avoid terminal version of emacs when possible.</li>
<li>Github doesn&rsquo;t render org files very well. It&rsquo;s best that you <a href="https://raw.githubusercontent.com/niyumard/Doom-Emacs-Cheat-Sheet/main/README.org">download this file</a> and open it in Emacs. If not possible, use the <a href="https://naghdbishi.ir/Doom-Emacs-Cheat-Sheet/README.html">html version</a> made with <a href="https://github.com/fniessen/org-html-themes">org-html-themes</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc66952c" class="outline-2">
<h2 id="orgc66952c"><span class="section-number-2">2.</span> Command Abbreviations</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>C</code> - &ldquo;Control&rdquo; key</li>
<li><code>M</code> - &ldquo;M&rdquo; or &ldquo;option/alt&rdquo; key</li>
<li><code>s</code> - &ldquo;Command&rdquo; key</li>
<li><code>SPC</code> - &ldquo;Space&rdquo; key</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd3b08d" class="outline-2">
<h2 id="orgbd3b08d"><span class="section-number-2">3.</span> General</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>SPC f s</code> for saving the current file</li>
<li><code>SPC :</code> for entering a command</li>
<li><code>SPC q q</code> to close Emacs</li>
<li><code>SPC f D</code> to delete this file</li>
</ul>
</div>
</div>
<div id="outline-container-orga06ffba" class="outline-2">
<h2 id="orga06ffba"><span class="section-number-2">4.</span> Projects with Projectile</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>SPC p p</code> to open a project</li>
<li><code>SPC SPC</code> to open a file in a project</li>
<li><code>SPC o p</code> to open the file explorer</li>
<li><code>SPC o E</code> to open the shell (eshell) in fullscreen</li>
<li><code>SPC o e</code> to open the shell (eshell) in a popup window</li>
<li><code>SPC f r</code> recently visited files</li>
<li><code>SPC f R</code> recently visited files in a project</li>
<li><code>M-x projectile-discover-projects-in-directory</code> to find projects
within given folder using Projectile</li>
<li><code>M-x projectile-discover-projects-in-search-path</code> to find projects in
the folder defined by the <code>projectile-project-search-path</code> variable
using Projectile</li>
</ul>
</div>
</div>
<div id="outline-container-org7ea6b6f" class="outline-2">
<h2 id="org7ea6b6f"><span class="section-number-2">5.</span> Dired</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Dired (Directory Editor) is how you interfaces with a directory</li>
<li>Press <code>C-x d</code> to open dired.
<li>Use <code>RET</code> to go to a folder or open a file.</li>
<li>Use <code>-</code> for going one folder back</li>
<li>Use <code>+</code> for creating a new directory</li>
<li>Use <code>d</code> to mark the files for deletion, press <code>x</code> to delete.</li>
<li>Use <code>M</code> to change permissions</li>
<li>Use <code>o</code> to sort by modes.</li>
<li>Use <code>O</code> to change the owner.</li>
<li>Use <code>m</code> to mark and <code>u</code> to unmark files or directories.</li>
<li><code>U</code> to unselect all</li>
<li>Use <code>t</code> to invert the selection.</li>
<li><code>t</code> to switch between files and directories</li>
<li>Use <code>C</code> to copy.</li>
<li>Use <code>R</code> to move.</li>
<li>Move with <code>h</code>, <code>j</code>, <code>k</code>, <code>l</code></li>
<li>Toggle <code>(</code> for simple view</li>
<li><code>SPC .</code> to create or find a file</li>
<li><code>*</code> to select all directories.</li>
<li><code>C</code> copy to another window</li>
<li><code>R</code> move to another window</li>
<li><code>dired-do-what-i-mean-target</code> set to true</li>
<li><code>i</code> to edit file/dir name</li>
</ul>
</div>
</div>
<div id="outline-container-org5424a93" class="outline-2">
<h2 id="org5424a93"><span class="section-number-2">6.</span> Buffers, Windows and Basic Navigation</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7465159" class="outline-3">
<h3 id="org7465159"><span class="section-number-3">6.1.</span> Buffers</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Buffers are a special concept in emacs they can be terminals, files,
directories, etc</li>
<li><code>SPC b b</code> to open another buffer
<ul class="org-ul">
<li>workspace buffer</li>
</ul></li>
<li><code>SPC b B</code> you can see all the buffer</li>
<li><code>SPC ,</code> to switch buffers (its an alias)</li>
<li><code>SPC SHIFT ,</code> to switch to all buffers</li>
<li><code>SPC b X</code> You can create a scratch buffer</li>
<li><code>SPC b s</code> to save and name it</li>
</ul>
</div>
</div>
<div id="outline-container-org40aac09" class="outline-3">
<h3 id="org40aac09"><span class="section-number-3">6.2.</span> Windows</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><code>CTRL w v</code> window split vertically</li>
<li><code>CTRL w s</code> window split horizonal</li>
<li><code>CTRL w w</code> to switch windows</li>
<li><code>SPC w q</code> to kill windows</li>
<li><code>SPC w +</code> and <code>SPC w -</code> to increase and decrease window height</li>
<li><code>SPC w &gt;</code> and <code>SPC w &lt;</code> to increase and decrease window width</li>
<li>You can use vim motion keys to navigate between open windows for example <code>SPC w H</code> moves the window to the left.</li>
<li>Windows are panes in your screen</li>
</ul>
</div>
</div>
<div id="outline-container-orge5e8a5c" class="outline-3">
<h3 id="orge5e8a5c"><span class="section-number-3">6.3.</span> Workspaces</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><code>SPC TAB n</code> New workspace</li>
<li><code>SPC TAB N</code> Newly named workspace</li>
<li><code>SPC TAB [</code> Previous workspace</li>
<li><code>SPC TAB ]</code> Next workspace</li>
<li><code>SPC TAB d</code> Remove workspace</li>
<li><code>SPC TAB R</code> Restore last session</li>
<li><code>M-1</code> Switch to workspace 1</li>
<li><code>M-2</code> Switch to workspace 2 and so forth.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdd329c8" class="outline-2">
<h2 id="orgdd329c8"><span class="section-number-2">7.</span> Installing Packages using org-super-agenda as an example</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>SPC f p</code> to open the config.</li>
<li>To add a package, add the package to <code>.doom.d/package.el</code></li>
<li>Then close and <code>doom refresh</code></li>
<li>Then go to <code>.doom.d/config.el</code> to configure the package</li>
<li><code>def-package!</code> is a macro you can use to configure packages
<ul class="org-ul">
<li><code>space h help</code> you can look up method man pages</li>
<li><code>:init</code> is used for setting the package up</li>
<li><code>:config</code> to set configuration after the package has been
initialized</li>
<li><code>:after</code> lets you set which package it should load after</li>
</ul></li>
<li>You can use <code>:after!</code> to configure packages that are already there</li>
</ul>
</div>
</div>
<div id="outline-container-orga100aff" class="outline-2">
<h2 id="orga100aff"><span class="section-number-2">8.</span> Quick, horizontal movements with evil-snipe</h2>
<div class="outline-text-2" id="text-8">
</div>
