README.html
<div id="outline-container-orgf374984" class="outline-3">
<h3 id="orgf374984"><span class="section-number-3">8.1.</span> Inine navigation</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><code>f</code> and then the letter you want to navigate to.
<ul class="org-ul">
<li><code>,</code> will go backward</li>
<li><code>;</code> will go forward after that &ldquo;find&rdquo;</li>
</ul></li>
<li><code>t</code> to find and move cursor to the charachter before what you&rsquo;ve searched.</li>
<li><code>v</code> puts you in visual mode. You can select text by with <code>v t some-char-you-navigate-to</code> or <code>v f some-char-you-navigate-to</code></li>
<li><code>;</code> to jump to the next find</li>
<li><code>,</code> to jump to the previous one</li>
<li><code>s</code> to snipe</li>
</ul>
</div>
</div>
<div id="outline-container-org2847e74" class="outline-3">
<h3 id="org2847e74"><span class="section-number-3">8.2.</span> Long distance navigation inside the file</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Evil-snipe lets you go to all the occuranses in your document</li>
<li><code>g s SPC</code> to use avy and going to a certain word in file.</li>
<li><code>t</code> is the same thing except for a character you want to jump to before the one you insert</li>
<li><code>s</code> to do a double character search</li>
<li>Evil-snipe will remember your last search so <code>,</code> and <code>;</code> will navigate</li>
<li><code>F</code> or <code>T</code> to go backwards</li>
<li><code>g s SPC</code> and then select the letter that avy gives you to navigate to that spot
<ul class="org-ul">
<li>These letters are on your home row so they are easy to click</li>
</ul></li>
<li><code>SPC h v</code> for variable, to set the avy variable to search all open
windows
<ul class="org-ul">
<li><code>avy-all-windows</code> lets you search in all windows open.</li>
</ul></li>
<li>You can remove a word with
<code>g s SPC select-one-letter x select-the-removal-spot</code>
<ul class="org-ul">
<li>You can use <code>X</code> to stay in your original spot of search</li>
</ul></li>
<li>You can go <code>g s space select-one-letter i select-the-correction-spot</code>
to correct the spelling of the search
<ul class="org-ul">
<li>Install ispell on your OS first</li>
</ul></li>
<li>You can <code>yank</code> a word from one place to another with
<code>g s SPC select-one-letter y select-the-correction-spot-to-paste</code></li>
<li>Use <code>t</code> to &ldquo;teleport&rdquo; the word from one place to another
<code>g s SPC select-one-letter t select-the-correction-spot-to-teleport</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4700314" class="outline-2">
<h2 id="org4700314"><span class="section-number-2">9.</span> Multiple cursor in Emacs with Evil-multiedit</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Make selections and then edit those selections interactively</li>
<li><code>M d</code> will select the current word, and again will find another
occurance</li>
<li><code>M D</code> will find the occurence upward</li>
<li>You can use a visual selection to select multiple words.</li>
<li><code>R</code> will select all occurances</li>
<li><code>CTRL n</code> for next selection <code>CTRL p</code> for previous</li>
<li>Exclude matches with <code>RET</code></li>
<li>You can make an edit and the changes will be reflected in all the
selection</li>
</ul>
</div>
</div>
<div id="outline-container-org3742fdd" class="outline-2">
<h2 id="org3742fdd"><span class="section-number-2">10.</span> Org Mode</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org93e23e9" class="outline-3">
<h3 id="org93e23e9"><span class="section-number-3">10.1.</span> Basics</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>Org mode gives you structure to your document</li>
<li><code>*</code> for a h1 <code>**</code> for an h2 and so on</li>
<li>You can <code>TAB</code> a section to fold a subtree (hide it)</li>
<li>You can use <code>SHIFT TAB</code> to cycle through folded states</li>
<li><code>CTRL return</code> to create a headline of the same type</li>
<li><code>M arrow up</code> lets you shift the position of the section</li>
<li><code>M h</code> promotes a headline to the next level</li>
<li><code>M l</code> demotes</li>
<li>You can create lists
<ol class="org-ol">
<li>onw</li>
<li>2</li>
<li>wooo</li>
<li>3</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgd86db83" class="outline-3">
<h3 id="orgd86db83"><span class="section-number-3">10.2.</span> Links, Hyperlinks and more</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li><code>SPC m l</code> to add a link to an org page</li>
<li>You can add <code>::</code> to specify a heading or a line number</li>
<li>You can paste http links as well</li>
<li>You can &ldquo;link&rdquo; some text with specific code <code>SPC m l</code> elisp: <a href="(+ 2 2)">(+ 2 2)</a> when you click the link, emacs will evaluate the expression</li>
<li>Show <a href="org-agenda">My Agenda</a></li>
<li><a href="ls">List Files</a> in directory</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2eac2b" class="outline-3">
<h3 id="orgf2eac2b"><span class="section-number-3">10.3.</span> Defining custoom Link Types</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li><a href="https://youtube.com/watch?v=Febe4lUK5G4">Whatch the video about custom links</a></li>
</ul>
</div>
</div>
<div id="outline-container-org994f865" class="outline-3">
<h3 id="org994f865"><span class="section-number-3">10.4.</span> Linking to words &amp; Bookmarks</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li><code>SPC n l</code> stores a link to a particular headline</li>
</ul>
</div>
</div>
<div id="outline-container-org5149c05" class="outline-3">
<h3 id="org5149c05"><span class="section-number-3">10.5.</span> Code Snippets &amp; Babel</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li><code>SPC i s</code> for inserting code snippets
<ul class="org-ul">
<li><p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #F92660;">(</span><span style="color: #9C91E4;">+</span> <span style="color: #9C91E4; font-weight: bold;">2</span> <span style="color: #9C91E4; font-weight: bold;">3</span> <span style="color: #9C91E4; font-weight: bold;">4</span> <span style="color: #9C91E4; font-weight: bold;">5</span><span style="color: #F92660;">)</span>
</pre>
</div></li>
</ul></li>
<li><code>C-c C-c</code> to execute the code.</li>
<li><code>SPC m '</code> to edit inside the babel in another buffer.</li>
<li>Results will show up in a <code>##+RESULTS</code> header</li>
<li>This feature is called Babel</li>
<li>One snippet can consume the output of another snippet</li>
<li>You can create your own snippets in the following directory: <code>~/.doom.d/snippets/</code></li>
</ul>
</div>
</div>
<div id="outline-container-org0527eeb" class="outline-3">
<h3 id="org0527eeb"><span class="section-number-3">10.6.</span> Task Management</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li>Create a task by prefixing any heading with <code>TODO</code></li>
<li><code>DONE</code> means the task is done</li>
<li>You can create your custom key words by changing this variable: <code>org-todo-keywords</code>
<ul class="org-ul">
<li>remember you can get to your variables through <code>SPC h v</code> (M-x counsel-describe-variable)</li>
<li><p>
These values are already set in Doom:
</p>
<pre class="example" id="org7acc537">
           ((sequence "TODO(t)" "PROJ(p)" "STRT(s)" "WAIT(w)" "HOLD(h)" "|" "DONE(d)" "KILL(k)")
        (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)"))
</pre></li>
</ul></li>
<li><code>SPC m t</code> to change a status of a todo</li>
<li><code>SHIFT left</code> and <code>SHIFT right</code> can be used to change the status of a todo as well.</li>
<li>If you finish a task with a command, org mode will add a date that you &ldquo;closed&rdquo; the task.</li>
<li><code>SPC o a t</code> to open the agenda -&gt; todo list</li>
<li><code>q</code> to quit</li>
<li><code>org-agenda-files</code> is a variable you can set to filter which files agenda searches for todos in.</li>
</ul>
</div>

<div id="outline-container-orgd401f1b" class="outline-4">
<h4 id="orgd401f1b"><span class="section-number-4">10.6.1.</span> Priorities for Tasks</h4>
<div class="outline-text-4" id="text-10-6-1">
<ul class="org-ul">
<li><code>SHIFT up</code> and <code>SHIFT down</code> will toggle the priority of tasks</li>
<li><code>org-fancy-priorities</code> gives you fancy looking priorities</li>
</ul>
</div>
</div>

<div id="outline-container-orgc9e3975" class="outline-4">
<h4 id="orgc9e3975"><span class="section-number-4">10.6.2.</span> Marking Tasks with Tags</h4>
<div class="outline-text-4" id="text-10-6-2">
<ul class="org-ul">
<li>Tags can be attached to any headlines</li>
<li><code>SPC m q</code> to tag a headline</li>
<li>Example:
<ul class="org-ul">
<li>TODO play more games :fun:</li>
</ul></li>
<li>Tags are hierarchical so nested headings will be tagged with the
parent header tag</li>
<li><code>org-tag-sparce-tree</code> will search for headings that only have a specific
tag</li>
</ul>
</div>
</div>

<div id="outline-container-org8616956" class="outline-4">
<h4 id="org8616956"><span class="section-number-4">10.6.3.</span> Setting a poperty for a task/headline</h4>
<div class="outline-text-4" id="text-10-6-3">
<ul class="org-ul">
<li><code>SPC m o</code> is used for setting a property.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgeb4b967"></a>Marking Headlines with Categories<br />
<div class="outline-text-5" id="text-10-6-3-1">
<ul class="org-ul">
<li>You can use <a href="https://orgmode.org/manual/Categories.html">categories</a> to change the label in agenda view.</li>
</ul>
</div>
</li>
<li><a id="orga3611b1"></a>Org-Habits<br />
<div class="outline-text-5" id="text-10-6-3-2">
<ul class="org-ul">
<li>If you want to <a href="https://orgmode.org/manual/Tracking-your-habits.html">keep track of your habits</a> using org mode, you can set the <code>STYLE</code> property to habit.

<ul class="org-ul">
<li>If you want to set a category (for chani</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
