README.org
** Lists
- Two types of lists, ordered and unordered lists
  - =SHIFT right= and =SHIFT left= can be used to change the type of lists.
- You can also change an unorded list by changing the first item to 1. and then typing =C-c C-c= and vice verca.
** Checkboxes
- [ ] This is still todo
- [-] This is in progress
- [X] This is a done task
*** You can see how many are done with a "cookie" [1/2]
- [-] Task 1
- [X] Task 2
- You can do this by adding [/] to the heading and pressing =C-c C-c=
- You can't assign a tag or a priority

* Magit
- Magit is enabled by default in Doom Emacs's init.el
- =SPC g g= shows Magit status page
  + Most commands are done from the status page
  + Use tab to expand headlines in the status page
- =?= in Magit's status page for a nice list of available commands and help, =q= to close this help page
- Open diff view for a file with =TAB=
- Press =s= under "Unstaged changes" to stage a change
  + =u= to undo a change
  + =c= to commit
- =b s= for branch and spinoff to create another branch, rewinding the
  commits you made to master
- =b b= to switch branches

** Git Commit Flow in More Detail
- =t t= to create a tag, default place is the commit you are currently
  selecting
- =V= to select a change in a diff and =x= to discard that change.
- =s= to stage
- =c= to commit, you can =q= to quit the commit screen
- =P= to push and then =p= to your remote or =u= to a another remote
** Magit with Forge for Issuing Pull Requests - Emacs
- Forge is installed in emacs doom
- =@= for forge
- Set up forge with =M x forge-pull=
  - the first time you will get a token from github
- =@ c p= to create a pull request with forge
  - select the base branch
  - then select the target branch
  - then provide a short description
  - =CTRL c CTRL c= to finish the pull request
- Now there will be a =pull requests= tab
* Terminal
- Set up vterm in your init.el file.
- =SPC o T= for opening vterm
- =SPC o t= for opening vterm in a popup window
* File Tree
- Set up neotree or treemacs in your init.el file.
- =SPC o p= for opening neotree or treemacs
* Others
- =C-c C-z= to insert a note for a heading in org mode.
:LOGBOOK:
- Note taken on [2020-12-18 Fri 21:52] \\
  Like this!
:END:
- =C-c C-c= to insert a tag for a heading in org mode.
* Capturing
- =SPC X= to capture (the new thing gets caputured to a single file but that's fine since we can easily refile it.)
- =SPC m r r= to refile
* Org Roam
These keybinding only work after installing org-roam. To install org roam edit your =init.el= file and add =(org +roam2)= in its designated place. Watch [[https://www.youtube.com/watch?v=AyhPmypHDEw][this video]] to understand what org-roam is.

- =SPC n r f= Find an existing node or create a new one.
- =SPC n r i= Insert a link to another node.
- =SPC n r r= Toggle backlinks pane 
- =SPC m m o t= Add a roam tag.
- =SPC m m o a= Add a roam alias.

* Sources
- [[https://www.youtube.com/watch?v=BRqjaN4-gGQ&list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj&index=10][Link to youtube video series]]
- [[https://www.ianjones.us/zaiste-programming-doom-emacs-tutorial/#org7ad2452][This org file is mostly from the notes taken from the series above by ianjones.us]]
- [[https://www.youtube.com/watch?v=s0ed8Da3mjE][Three Huge Mistakes New Emacs Users Make]] (they are included in the tips above)
* What to learn [0/2]
- [ ] [[https://orgroam.com][Org Roam]]
- [ ] abbrev-mode
