README.html
<div id="outline-container-org4422b97" class="outline-3">
<h3 id="org4422b97"><span class="section-number-3">10.7.</span> Lists</h3>
<div class="outline-text-3" id="text-10-7">
<ul class="org-ul">
<li>Two types of lists, ordered and unordered lists
<ul class="org-ul">
<li><code>SHIFT right</code> and <code>SHIFT left</code> can be used to change the type of lists.</li>
</ul></li>
<li>You can also change an unorded list by changing the first item to 1. and then typing <code>C-c C-c</code> and vice verca.</li>
</ul>
</div>
</div>
<div id="outline-container-org07f3b12" class="outline-3">
<h3 id="org07f3b12"><span class="section-number-3">10.8.</span> Checkboxes</h3>
<div class="outline-text-3" id="text-10-8">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> This is still todo</li>
<li class="trans"><code>[-]</code> This is in progress</li>
<li class="on"><code>[X]</code> This is a done task</li>
</ul>
</div>
<div id="outline-container-org65378d5" class="outline-4">
<h4 id="org65378d5"><span class="section-number-4">10.8.1.</span> You can see how many are done with a &ldquo;cookie&rdquo; <code>[1/2]</code></h4>
<div class="outline-text-4" id="text-10-8-1">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Task 1</li>
<li class="on"><code>[X]</code> Task 2</li>
<li>You can do this by adding <code>[/]</code> to the heading and pressing <code>C-c C-c</code></li>
<li>You can&rsquo;t assign a tag or a priority</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orga4062cb" class="outline-2">
<h2 id="orga4062cb"><span class="section-number-2">11.</span> Magit</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>magit is configured for you</li>
<li><code>SPC g g</code> to show Magit status Page</li>
<li>most commands are done from the status page</li>
<li>press <code>?</code> to see what you can do</li>
<li><code>git add -p</code> lets you stage in hunks</li>
<li>Open and close with the <code>TAB</code></li>
<li>Open diff view for a file with <code>TAB</code></li>
<li><code>s</code> to stage a change</li>
<li><code>u</code> to undo a change</li>
<li><code>c</code> to commit</li>
<li><code>b s</code> for branch and spinoff to create another branch, rewinding the
commits you made to master</li>
<li><code>b b</code> to switch branches</li>
</ul>
</div>

<div id="outline-container-org6233002" class="outline-3">
<h3 id="org6233002"><span class="section-number-3">11.1.</span> Git Commit Flow in More Detail</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li><code>t t</code> to create a tag, default place is the commit you are currently
selecting</li>
<li><code>V</code> to select a change in a diff and <code>x</code> to discard that change.</li>
<li><code>s</code> to stage</li>
<li><code>c</code> to commit, you can <code>q</code> to quit the commit screen</li>
<li><code>P</code> to push and then <code>p</code> to your remote or <code>u</code> to a another remote</li>
</ul>
</div>
</div>
<div id="outline-container-org7f8a9d2" class="outline-3">
<h3 id="org7f8a9d2"><span class="section-number-3">11.2.</span> Magit with Forge for Issuing Pull Requests - Emacs</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Forge is installed in emacs doom</li>
<li><code>@</code> for forge</li>
<li>Set up forge with <code>M x forge-pull</code>
<ul class="org-ul">
<li>the first time you will get a token from github</li>
</ul></li>
<li><code>@ c p</code> to create a pull request with forge
<ul class="org-ul">
<li>select the base branch</li>
<li>then select the target branch</li>
<li>then provide a short description</li>
<li><code>CTRL c CTRL c</code> to finish the pull request</li>
</ul></li>
<li>Now there will be a <code>pull requests</code> tab</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8760360" class="outline-2">
<h2 id="org8760360"><span class="section-number-2">12.</span> Terminal</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Set up vterm in your init.el file.</li>
<li><code>SPC o T</code> for opening vterm</li>
<li><code>SPC o t</code> for opening vterm in a popup window</li>
</ul>
</div>
</div>
<div id="outline-container-org1e70de6" class="outline-2">
<h2 id="org1e70de6"><span class="section-number-2">13.</span> File Tree</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Set up neotree or treemacs in your init.el file.</li>
<li><code>SPC o p</code> for opening neotree or treemacs</li>
</ul>
</div>
</div>
<div id="outline-container-org3fae2c4" class="outline-2">
<h2 id="org3fae2c4"><span class="section-number-2">14.</span> Others</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li><code>C-c C-z</code> to insert a note for a heading in org mode.</li>
</ul>
<ul class="org-ul">
<li><code>C-c C-c</code> to insert a tag for a heading in org mode.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7f34e7" class="outline-2">
<h2 id="orgf7f34e7"><span class="section-number-2">15.</span> Capturing</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li><code>SPC X</code> to capture (the new thing gets caputured to a single file but that&rsquo;s fine since we can easily refile it.)</li>
<li><code>SPC m r r</code> to refile</li>
</ul>
</div>
</div>
<div id="outline-container-org6b8c4b9" class="outline-2">
<h2 id="org6b8c4b9"><span class="section-number-2">16.</span> Org Roam</h2>
<div class="outline-text-2" id="text-16">
<p>
These keybinding only work after installing org-roam. To install org roam edit your <code>init.el</code> file and add <code>(org +roam2)</code> in its designated place. Watch <a href="https://www.youtube.com/watch?v=AyhPmypHDEw">this video</a> to understand what org-roam is.
</p>

<ul class="org-ul">
<li><code>SPC n r f</code> Find an existing node or create a new one.</li>
<li><code>SPC n r i</code> Insert a link to another node.</li>
<li><code>SPC n r r</code> Toggle backlinks pane</li>
<li><code>SPC m m o t</code> Add a roam tag.</li>
<li><code>SPC m m o a</code> Add a roam alias.</li>
</ul>
</div>
</div>

<div id="outline-container-org1e52724" class="outline-2">
<h2 id="org1e52724"><span class="section-number-2">17.</span> Sources</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=BRqjaN4-gGQ&amp;list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj&amp;index=10">Link to youtube video series</a></li>
<li><a href="https://www.ianjones.us/zaiste-programming-doom-emacs-tutorial/#org7ad2452">This org file is mostly from the notes taken from the series above by ianjones.us</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga354843" class="outline-2">
<h2 id="orga354843"><span class="section-number-2">18.</span> What to learn <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Org-journal</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://orgroam.com">Org Roam</a></li>
<li class="off"><code>[&#xa0;]</code> abbrev-mode</li>
<li class="off"><code>[&#xa0;]</code> Org-super-agenda</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hossein Naghdbishi</p>
<p class="date">Created: 2021-11-17 Wed 00:14</p>
</div>
</body>
</html>
